In [42]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------- ------------------------------ 10.2/45.0 kB ? eta -:--:--
   --------------------------- ------------ 30.7/45.0 kB 262.6 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 369.5 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [17]:
#  import the library

import pandas as pd
import numpy as np
import mysql.connector
from sqlalchemy import create_engine

In [25]:
conn = mysql.connector.connect(
    user = "root",
    password = "Sagar89#*",
    host = "localhost",
    database = "pizza_sales"
)

conn

In [26]:
my_cursor = conn.cursor()

In [27]:
my_cursor.execute("SELECT * FROM pizza_sales.orders")

In [28]:
data = my_cursor.fetchall()

In [47]:
#print(data)

In [32]:
df = pd.DataFrame(data)
df

           0           1         2
0          1  2015-01-01  11:38:36
1          2  2015-01-01  11:57:40
2          3  2015-01-01  12:12:28
3          4  2015-01-01  12:16:31
4          5  2015-01-01  12:21:30
...      ...         ...       ...
21345  21346  2015-12-31  20:51:07
21346  21347  2015-12-31  21:14:37
21347  21348  2015-12-31  21:23:10
21348  21349  2015-12-31  22:09:54
21349  21350  2015-12-31  23:02:05

[21350 rows x 3 columns]

In [34]:
df = df.rename(columns={0:"no.",1:"date",2:"time"})

In [38]:
df = df.set_index("no.")

In [39]:
df

             date      time
no.
1      2015-01-01  11:38:36
2      2015-01-01  11:57:40
3      2015-01-01  12:12:28
4      2015-01-01  12:16:31
5      2015-01-01  12:21:30
...           ...       ...
21346  2015-12-31  20:51:07
21347  2015-12-31  21:14:37
21348  2015-12-31  21:23:10
21349  2015-12-31  22:09:54
21350  2015-12-31  23:02:05

[21350 rows x 2 columns]

In [40]:
df.to_csv("D:/Downloads/pizza_sales_recoed.csv")

In [44]:
engine = create_engine("mysql+pymysql://root:Sagar89#*@localhost/pizza_sales")

In [46]:
df.to_sql("order_1",con=engine)

21350